using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;
using Shop.Data.Interfaces;
using Shop.Data.Models;

namespace Shop.Data.Mocks
{
    public class MockItems //: IItems
    {
        public ICategorys _category = new MockCategorys();

        public IEnumerable<Items> AllItems
        {
            get
            {
                return new List<Items>()
                {
                    new Items()
                    {
                        Id = 1,
                        Name = "DEXP MS-70",
                        Description = "ОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОп исаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписани еОписаниеОписаниеОписаниеОписание" +
                        " ОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписани еОписание ОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписание ОписаниеОписаниеОписание" +
                        " ОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписани ОписаниеОписаниеОписаниеОписаниеОписаниеОписа ниеОписание" +
                        " ОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОп исаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписание" +
                        " ОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписани еОписаниеОписаниеОписаниеОписаниеОписаниеО писаниеОписаниеОписаниеОписаниеОписаниеОпис аниеОписаниеОписание" +
                        " ОписаниеОписаниеОписаниеОписаниеОписа ниеОписаниеОписаниеОписа ниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписани еОписаниеОписаниеОписание",
                        Img = "https://sun3-10.userapi.com/impg/Ay-zhw9s4ph0djVAxoHHUqZJNG28uJw4h4hBRg/qN0MFe7HMX8.jpg?size=208x198&quality=96&sign=81cb4d3f431a62a3e5c88e003683a020&type=album",
                        Price = 3699,
                        Category = _category.AllCategorys.Where(x => x.Id == 1).First()
                    },
                    new Items()
                    {
                        Id = 2,
                        Name = "ADasDSDASD",
                        Description = "ОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОп исаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписани еОписаниеОписаниеОписаниеОписание" +
                        " ОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписани еОписание ОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписание ОписаниеОписаниеОписание" +
                        " ОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписани ОписаниеОписаниеОписаниеОписаниеОписаниеОписа ниеОписание" +
                        " ОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОп исаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписание" +
                        " ОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписани еОписаниеОписаниеОписаниеОписаниеОписаниеО писаниеОписаниеОписаниеОписаниеОписаниеОпис аниеОписаниеОписание" +
                        " ОписаниеОписаниеОписаниеОписаниеОписа ниеОписаниеОписаниеОписа ниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписани еОписаниеОписаниеОписание",
                        Img = "https://sun3-10.userapi.com/impg/Ay-zhw9s4ph0djVAxoHHUqZJNG28uJw4h4hBRg/qN0MFe7HMX8.jpg?size=208x198&quality=96&sign=81cb4d3f431a62a3e5c88e003683a020&type=album",
                        Price = 5000,
                        Category = _category.AllCategorys.Where(x => x.Id == 1).First()
                    },
                    new Items()
                    {
                        Id = 3,
                        Name = "AAAAAAAAAAAAAAAAAAAAAAA",
                        Description = "ОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОп исаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписани еОписаниеОписаниеОписаниеОписание" +
                        " ОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписани еОписание ОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписание ОписаниеОписаниеОписание" +
                        " ОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписани ОписаниеОписаниеОписаниеОписаниеОписаниеОписа ниеОписание" +
                        " ОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОп исаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписание" +
                        " ОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписани еОписаниеОписаниеОписаниеОписаниеОписаниеО писаниеОписаниеОписаниеОписаниеОписаниеОпис аниеОписаниеОписание" +
                        " ОписаниеОписаниеОписаниеОписаниеОписа ниеОписаниеОписаниеОписа ниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписаниеОписани еОписаниеОписаниеОписание",
                        Img = "https://sun3-9.userapi.com/impg/YqCtWeufiNpxsj1LyddNEd9a55yUSBdHxRJGkg/KLjrdcmy7ew.jpg?size=2048x1024&quality=96&sign=fbc0ae5ba6429dbc682d76260e79070e&type=album",
                        Price = 1000,
                        Category = _category.AllCategorys.Where(x => x.Id == 2).First()
                    }
                };
            }
        }
    }
}
